[
    {
        "category": "Linux",
        "questions": [
            "What kind of virtualization technologies are you familiar with?",
            "What command line text manipulation tools are you familiar with?",
            "How would you schedule a command to run every Sunday at midnight?",
            "How would you check the available resources (memory, disk space, CPU)?",
            "What are hard links and symbolic links?",
            "What are services in the context of Linux?",
            "Describe the permission model of Linux! How would you make a file only readable and writable by its owner?",
            "What is the difference between Gi, Gb and GB?",
            "What are some well-known configuration files on a Linux OS?",
            "Explain the 'set' builtin command and some of its most commonly used flags!"
        ]
    },
    {
        "category": "Networking",
        "questions": [
            "What is a MAC address?",
            "What is the difference between binding to 127.0.0.1 or 0.0.0.0?",
            "What are the Layers of the OSI model?",
            "What is the difference between a router and a switch?",
            "What is the difference between TCP and UDP?",
            "What is a VPN?",
            "What is DNS?",
            "What is DHCP?",
            "What are some well-known ports?",
            "What are the private IP address ranges?",
            "How many usable addresses are in 192.168.1.0/24?",
            "What network diagnostic/debugging tools are you familiar with?",
            "What is the purpose of the ARP protocol?",
            "What are the basic networking components in AWS?"
        ]
    },
    {
        "category": "Security",
        "questions": [
            "What is encryption at rest and encryption in transit, and how are these implemented in AWS?",
            "Which service is responsible for monitoring and log collection in AWS?",
            "What is a bastion host, and how can it be implemented in AWS?",
            "What are the key differences between security groups and NACLs?",
            "Which service is responsible for tracking activities on an AWS account?",
            "Explain the difference between symmetric and asymmetric encryption!",
            "What is the Principle of Least Privilege, and how can it be implemented in AWS?",
            "How do AWS IAM roles differ from IAM users, and in what scenarios would you use each?",
            "Explain the AWS Shared Responsibility Model in the context of security."
        ]
    },
    {
        "category": "Containers and container orchestration",
        "questions": [
            "What are the key differences between containers and virtual machines?",
            "What are the most important instructions in a Dockerfile?",
            "What is the difference between the CMD and the ENTRYPOINT instructions?",
            "How does caching work in docker builds?",
            "What are some common practices for optimizing container image size?",
            "What problems can occur when the 'latest' tag is used? ",
            "Explain the architecture of a Kubernetes cluster!",
            "What is the Deployment Kubernetes object responsible for?",
            "What kind of probes are there in Kubernetes, and what are their use cases?",
            "What is the difference between resource Limit and Request?",
            "What is the Service Kubernetes object responsible for?",
            "What are the main differences between ConfigMaps and Secrets?"
        ]
    },
    {
        "category": "Infrastructure as Code",
        "questions": [
            "What is Infrastructure as Code? What are its advantages and disadvantages?",
            "What are the basic commands of the terraform workflow?",
            "What is the difference between resources and data sources in terraform?",
            "What does state mean in the context of terraform?",
            "What are modules in terraform?",
            "List the meta-arguments in terraform with their use cases!",
            "What is the best practice for a terraform project's file structure?"
        ]
    },
    {
        "category": "Practical Task",
        "questions": [
            "Bash",
            "Docker",
            "Docker Compose",
            "Terraform",
            "Kubernetes"
        ]
    }
]
